Repository: daniellyatuu/huru-server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: English
sw: kiingereza

source: Swahili
sw: Kiswahili

source: Copyright
sw: Hakimiliki

source: Huru all rights reserved.
sw: Huru haki zote zimehifadhiwa.

source: Huru for People With Drug Use Disorders
sw: Huru kwa watu wenye shida ya matumizi ya dawa za kulevya

source: Home
sw: Nyumbani

source: Information
sw: Habari

source: Huru for Healthcare Workers
sw: Huru kwa Wafanyakazi wa Huduma za Afya

source: Testimonies
sw: Ushuhuda

source: Find Services
sw: Pata Huduma

source: About Us
sw: Kuhusu sisi

source: About
sw: Kuhusu

source: WHO ARE WE?
sw: SISI NI NANI?

source: We are team of digital health researchers from Muhimbili University of Health and Allied Sciences, Ministry of Health Tanzania working together with Casa famiglia rosseta Italy. We have developed this application to increase information access for people with drug use disorders and their care takers as well as the healthcare workers. This is to ensure that people with drug use disorders get the best evidence-based services and health care workers have access to information on how to best to care and treat their patients.
sw: Sisi ni timu ya watafiti wa afya ya dijiti kutoka Chuo Kikuu cha Afya na Sayansi Shirikishi ya Muhimbili, Wizara ya Afya Tanzania inayofanya kazi pamoja na Casa famiglia rosseta Italia. Tumeanzisha programu tumizi hii ili kuongeza ufikiaji wa habari kwa watu walio na shida ya utumiaji wa dawa za kulevya na wachukua huduma zao na pia wafanyikazi wa huduma ya afya. Hii ni kuhakikisha kuwa watu walio na shida ya utumiaji wa dawa za kulevya wanapata huduma bora za msingi wa ushahidi na wafanyikazi wa huduma ya afya wanapata habari juu ya jinsi ya kuwajali na kuwatibu wagonjwa wao.

source: Huru App is a referral service that provides information about addiction treatment practitioners and facilities.
sw: Huru App ni huduma ya rufaa ambayo hutoa habari kuhusu watendaji wa matibabu na madawa ya kulevya.

source: Huru App is not a medical provider or treatment facility and does not provide medical advice.
sw: Huru App sio mtoa huduma ya matibabu au kituo cha matibabu na haitoi ushauri wa matibabu.

source: Huru App does not endorse any treatment facility or guarantee the quality of care provided, or the results to be achieved, by any treatment facility.
sw: Huru App haidhinishi kituo chochote cha matibabu au kuhakikisha ubora wa huduma inayotolewa, au matokeo yatakayopatikana, na kituo chochote cha matibabu.

source: The information provided by Huru App is not a substitute for professional treatment advice.
sw: Habari iliyotolewa na Huru App sio mbadala wa ushauri wa matibabu ya kitaalam.

source: Mission
sw: Utume

source: To create a happy community where people are free from addiction and engage in productive activities
sw: Kuunda jamii yenye furaha ambapo watu wako huru kutoka kwa uraibu na wanafanya shughuli za uzalishaji

source: Vission
sw: Maono

source: To ensure access of information and services that facilitate recovery of people from substance use disorder and build a healthy community which is free from drug addiction
sw: Kuhakikisha upatikanaji wa habari na huduma zinazowezesha kupona kwa watu kutoka shida ya utumiaji wa dawa na kujenga jamii yenye afya ambayo haina utumiaji wa dawa za kulevya

source: Posts
sw: Machapisho

source: Our Popular Posts
sw: Machapisho Yetu Maarufu

source: All Posts
sw: Machapisho Yote

source: Read More
sw: Soma zaidi

source: By
sw: Na

source: No Post
sw: Hakuna Chapisho

source: You are not alone
sw: Hauko peke yako

source: Recovery is Possible
sw: Kupona kunawezekana

source: You can stop using drugs, you just have to make the decision to do so today.
sw: Unaweza kuacha kutumia dawa za kulevya, unapaswa kuamua kufanya hivyo leo

source: search services
sw: tafuta huduma

source: Are you ready to get the real you back?
sw: Uko tayari kurudisha uhalisia wako?

source: We will help you to find where you can go for treatment and other essential services
sw: Tutakusaidia kufahamu vituo ambavyo unaweza kwenda kupata matibabu na huduma nyingine muhimu.

source: Addiction affects all communities
sw: Uraibu huathiri jamii zote

source: Making the decision to find a detox center or drug or alcohol rehab is the first step toward a new, healthy life.
sw: Maamuzi ya kufika kwenye kituo cha huduma ya urahibu ni hatua ya kwanza kuelekea maisha yenye afya njema.

source: Total Articals
sw: Jumla ya Nakala

source: Testimony
sw: Ushuhuda

source: View All
sw: Tazama zote

source: No Testimony
sw: Hakuna Ushuhuda

source: Available Services
sw: Huduma Zinazopatikana

source: Services
sw: Huduma

source: Facility
sw: Kituo

source: Facility-Type
sw: Aina ya Kituo

source: Service
sw: Huduma

source: Contact
sw: Mawasiliano

source: Location
sw: Mahali

source: No Service
sw: Hakuna Huduma

source: testimony
sw: ushuhuda

source: People Testimony
sw: Ushuhuda wa Watu
